cask "alfred"
cask "visual-studio-code"
# cask "docker"
cask "bettertouchtool"
cask "istat-menus"
cask "dash"
cask "numi" # calculator app
# cask "arduino"
cask "spotify"
cask "shiori"
cask "caffeine"
cask "kitty"
# cask "dropbox"
cask "scroll-reverser"
cask "sensiblesidebuttons"

tap "homebrew/cask-fonts"
cask "font-input"

tap "thoughtbot/formulae"
brew "rcm"

brew "ripgrep"
brew "fd"
brew "fzf"
brew "git"
brew "zsh"
brew "fish"
brew "gnupg"
brew "bench"
brew "direnv"
brew "tmux"
brew "tmuxinator"

tap "jtyr/repo"
brew "gbt"

brew "cmake"

brew "neovim"
tap "d12frosted/emacs-plus"
brew "emacs-plus", link: true

brew "htop"
brew "httpie"

brew "rbenv"
brew "nvm"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "sshuttle"
brew "autojump"
brew "mr"
# brew "postgresql"

# brew "elixir"

# brew "libyaml"
# brew "libxml2"
# brew "libxslt"
# brew "readline"
# brew "openssl"
# brew "openssl-osx-ca"
# brew "vim"
# brew "postgresql"
