# Desktop apps
cask "alfred"
cask "visual-studio-code"
cask "discord"
cask "numi" # calculator app
cask "kitty" # terminal
cask "the-unarchiver"
cask "firefox"
cask "fork"
cask "telegram"

# Fonts
tap "homebrew/cask-fonts"
cask "font-input"
cask "font-dejavu-sans-mono-nerd-font"

# Notes
tap "xwmx/taps"
brew "nb"

# Window manager
# brew "koekeishiya/formulae/yabai"
# brew "koekeishiya/formulae/skhd"

# To remap capslock to FN for window manager
# cask "karabiner-elements"
# tap "yqrashawn/goku"
# brew "goku"

# Hardware
# cask "sensiblesidebuttons" # enable the use of back/forward button on external mice
# cask "scroll-reverser" # change scroll wheel direction on external mice only

# Editors
brew "neovim"
# tap "d12frosted/emacs-plus"
# brew "emacs-plus", link: true

# CLI Utils
brew "ripgrep"
brew "fd"
brew "fzf" # used by vim
brew "git"
brew "zsh"
brew "fish"
brew "gnupg"
brew "bench"
brew "direnv"
brew "tmux"
brew "tmuxinator"
brew "exa" # alternative for "ls"
brew "ssh-audit"
brew "rename"
brew "watchexec"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "sshuttle"
brew "autojump"
brew "mr"
brew "lazygit"
brew "tree-sitter"

# Languages
brew "rbenv"
brew "fnm"
brew "pnpm"

# Dev stuff
#
# brew "postgresql"


# brew "elixir"

# brew "libyaml"
# brew "libxml2"
# brew "libxslt"
# brew "readline"
# brew "openssl"
# brew "openssl-osx-ca"
# brew "vim"
