# Desktop apps
cask "alfred"
cask "visual-studio-code"
cask "discord"
cask "msteams"
cask "istat-menus"
cask "dash" # code docs
cask "paw" # preview http requests
cask "numi" # calculator app
cask "spotify" # musio
cask "shiori" # pinboard app
cask "caffeine" # don't sleep display
cask "kitty" # terminal
cask "riot" # alternative work chat
cask "the-unarchiver"

# Fonts
tap "homebrew/cask-fonts"
cask "font-input"

# Dotfiles management
tap "thoughtbot/formulae"
brew "rcm"


# Window manager
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

# To remap capslock to FN for window manager
cask "karabiner-elements"
tap "yqrashawn/goku"
brew "goku"

# Hardware
cask "bettertouchtool"
cask "sensiblesidebuttons" # enable the use of back/forward button on external mice
cask "scroll-reverser" # change scroll wheel direction on external mice only

# Editors
brew "neovim"
tap "d12frosted/emacs-plus"
brew "emacs-plus", link: true

# CLI Utils
brew "ripgrep"
brew "fd"
brew "fzf" # used by vim
brew "git"
brew "zsh"
brew "fish"
brew "gnupg"
brew "bench"
brew "direnv"
brew "tmux"
brew "tmuxinator"
brew "exa" # alternative for "ls"
brew "ssh-audit"
brew "rename"
brew "watchexec"

tap "jtyr/repo"
brew "gbt"

brew "cmake"


brew "htop"
brew "httpie"

brew "rbenv"
brew "nvm"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "sshuttle"
brew "autojump"
brew "mr"
# brew "postgresql"


# brew "elixir"

# brew "libyaml"
# brew "libxml2"
# brew "libxslt"
# brew "readline"
# brew "openssl"
# brew "openssl-osx-ca"
# brew "vim"
# brew "postgresql"
