;;;  -*- lexical-binding: t; -*-

(package! org-projectile)

; API documentation format
(package! apib-mode)

(package! emr)
(package! ein)

; Remove whitespace from changed lines
(package! ws-butler)

; Languages
(package! groovy-mode)
(package! crystal-mode)

; Refactoring functions for Ruby
(package! ruby-refactor)

; Major mode which lets you test HTTP APIs
(package! restclient)

; Open Zeal (documentation browser) for function at point
(package! zeal-at-point)

; HAML
(package! haml-mode)
